Revit 2024 API
BuiltInFailures.DuctFailures.PartNotFoundDueToNoDuctConnectedWarning Property
 "In order to find a matching part, the fitting has to be connected to a duct."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PartNotFoundDueToNoDuctConnectedWarning { get; }
Visual Basic
Public Shared ReadOnly Property PartNotFoundDueToNoDuctConnectedWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PartNotFoundDueToNoDuctConnectedWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DuctFailures Class
Autodesk.Revit.DB Namespace